performance-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 6
      arrivalRate: 5
      name: Warm up
    - duration: 6
      arrivalRate: 5
      rampTo: 5
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      name: Sustained load
  payload:
    path: "user.csv"
    fields:
      - "name"
      - "login"
      - "password"

scenarios:
  - name: "create delete get"
    flow:
      - post:
          url: "/users"
          json:
            name: "{{ name }}"
            login: "{{ login }}"
            password: "{{ password }}"
          capture:
            - json: "$.id"
              as: "userId"
      - delete:
          url: "/users/{{ userId }}"
      - get:
          url: "/users/{{ userId }}"